redis_benchmark/test/withoutKubearmor6_10000000.txt
====== GET ======
  10000000 requests completed in 5.08 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 26.543 milliseconds (cumulative count 1000)
50.000% <= 302.591 milliseconds (cumulative count 5013000)
75.000% <= 326.655 milliseconds (cumulative count 7503000)
87.500% <= 344.575 milliseconds (cumulative count 8757000)
93.750% <= 354.815 milliseconds (cumulative count 9381000)
96.875% <= 374.015 milliseconds (cumulative count 9688000)
98.438% <= 399.103 milliseconds (cumulative count 9844000)
99.219% <= 407.807 milliseconds (cumulative count 9924000)
99.609% <= 410.879 milliseconds (cumulative count 9961000)
99.805% <= 412.415 milliseconds (cumulative count 9983000)
99.902% <= 572.927 milliseconds (cumulative count 9997000)
99.976% <= 573.439 milliseconds (cumulative count 10000000)
100.000% <= 573.439 milliseconds (cumulative count 10000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.140% <= 27.103 milliseconds (cumulative count 14000)
0.300% <= 28.111 milliseconds (cumulative count 30000)
0.450% <= 29.103 milliseconds (cumulative count 45000)
0.590% <= 30.111 milliseconds (cumulative count 59000)
0.740% <= 31.103 milliseconds (cumulative count 74000)
0.890% <= 32.111 milliseconds (cumulative count 89000)
1.040% <= 33.119 milliseconds (cumulative count 104000)
1.170% <= 34.111 milliseconds (cumulative count 117000)
1.180% <= 35.103 milliseconds (cumulative count 118000)
1.300% <= 82.111 milliseconds (cumulative count 130000)
1.430% <= 83.135 milliseconds (cumulative count 143000)
1.650% <= 84.159 milliseconds (cumulative count 165000)
1.870% <= 85.119 milliseconds (cumulative count 187000)
1.910% <= 140.159 milliseconds (cumulative count 191000)
2.050% <= 141.183 milliseconds (cumulative count 205000)
2.190% <= 142.207 milliseconds (cumulative count 219000)
2.310% <= 143.103 milliseconds (cumulative count 231000)
2.440% <= 144.127 milliseconds (cumulative count 244000)
2.570% <= 145.151 milliseconds (cumulative count 257000)
2.680% <= 146.175 milliseconds (cumulative count 268000)
2.810% <= 147.199 milliseconds (cumulative count 281000)
2.950% <= 148.223 milliseconds (cumulative count 295000)
3.070% <= 149.119 milliseconds (cumulative count 307000)
3.220% <= 150.143 milliseconds (cumulative count 322000)
3.360% <= 151.167 milliseconds (cumulative count 336000)
3.500% <= 152.191 milliseconds (cumulative count 350000)
3.640% <= 153.215 milliseconds (cumulative count 364000)
3.730% <= 154.111 milliseconds (cumulative count 373000)
3.870% <= 155.135 milliseconds (cumulative count 387000)
4.000% <= 156.159 milliseconds (cumulative count 400000)
4.150% <= 157.183 milliseconds (cumulative count 415000)
4.280% <= 158.207 milliseconds (cumulative count 428000)
4.400% <= 159.103 milliseconds (cumulative count 440000)
4.550% <= 160.127 milliseconds (cumulative count 455000)
4.680% <= 161.151 milliseconds (cumulative count 468000)
4.790% <= 162.175 milliseconds (cumulative count 479000)
4.900% <= 163.199 milliseconds (cumulative count 490000)
5.040% <= 164.223 milliseconds (cumulative count 504000)
5.160% <= 165.119 milliseconds (cumulative count 516000)
5.310% <= 166.143 milliseconds (cumulative count 531000)
5.430% <= 167.167 milliseconds (cumulative count 543000)
5.470% <= 168.191 milliseconds (cumulative count 547000)
5.500% <= 169.215 milliseconds (cumulative count 550000)
5.530% <= 170.111 milliseconds (cumulative count 553000)
5.560% <= 171.135 milliseconds (cumulative count 556000)
5.590% <= 172.159 milliseconds (cumulative count 559000)
5.620% <= 173.183 milliseconds (cumulative count 562000)
5.640% <= 174.207 milliseconds (cumulative count 564000)
5.650% <= 195.199 milliseconds (cumulative count 565000)
5.680% <= 196.223 milliseconds (cumulative count 568000)
5.710% <= 197.119 milliseconds (cumulative count 571000)
5.740% <= 198.143 milliseconds (cumulative count 574000)
5.760% <= 199.167 milliseconds (cumulative count 576000)
5.780% <= 200.191 milliseconds (cumulative count 578000)
5.800% <= 201.215 milliseconds (cumulative count 580000)
5.810% <= 202.111 milliseconds (cumulative count 581000)
5.850% <= 203.135 milliseconds (cumulative count 585000)
5.880% <= 204.159 milliseconds (cumulative count 588000)
5.900% <= 205.183 milliseconds (cumulative count 590000)
5.940% <= 226.175 milliseconds (cumulative count 594000)
6.160% <= 227.199 milliseconds (cumulative count 616000)
6.540% <= 228.223 milliseconds (cumulative count 654000)
6.930% <= 229.119 milliseconds (cumulative count 693000)
7.460% <= 230.143 milliseconds (cumulative count 746000)
7.990% <= 231.167 milliseconds (cumulative count 799000)
8.480% <= 232.191 milliseconds (cumulative count 848000)
9.000% <= 233.215 milliseconds (cumulative count 900000)
9.410% <= 234.111 milliseconds (cumulative count 941000)
9.930% <= 235.135 milliseconds (cumulative count 993000)
10.430% <= 236.159 milliseconds (cumulative count 1043000)
10.940% <= 237.183 milliseconds (cumulative count 1094000)
11.470% <= 238.207 milliseconds (cumulative count 1147000)
11.950% <= 239.103 milliseconds (cumulative count 1195000)
12.620% <= 240.127 milliseconds (cumulative count 1262000)
13.340% <= 241.151 milliseconds (cumulative count 1334000)
13.930% <= 242.175 milliseconds (cumulative count 1393000)
14.860% <= 243.199 milliseconds (cumulative count 1486000)
15.730% <= 244.223 milliseconds (cumulative count 1573000)
16.440% <= 245.119 milliseconds (cumulative count 1644000)
17.210% <= 246.143 milliseconds (cumulative count 1721000)
18.020% <= 247.167 milliseconds (cumulative count 1802000)
18.850% <= 248.191 milliseconds (cumulative count 1885000)
19.590% <= 249.215 milliseconds (cumulative count 1959000)
20.410% <= 250.111 milliseconds (cumulative count 2041000)
21.210% <= 251.135 milliseconds (cumulative count 2121000)
22.050% <= 252.159 milliseconds (cumulative count 2205000)
22.870% <= 253.183 milliseconds (cumulative count 2287000)
23.680% <= 254.207 milliseconds (cumulative count 2368000)
24.360% <= 255.103 milliseconds (cumulative count 2436000)
25.070% <= 256.127 milliseconds (cumulative count 2507000)
25.790% <= 257.151 milliseconds (cumulative count 2579000)
26.430% <= 258.175 milliseconds (cumulative count 2643000)
26.990% <= 259.199 milliseconds (cumulative count 2699000)
27.530% <= 260.223 milliseconds (cumulative count 2753000)
27.960% <= 261.119 milliseconds (cumulative count 2796000)
28.480% <= 262.143 milliseconds (cumulative count 2848000)
28.870% <= 263.167 milliseconds (cumulative count 2887000)
29.310% <= 264.191 milliseconds (cumulative count 2931000)
29.810% <= 265.215 milliseconds (cumulative count 2981000)
30.310% <= 266.239 milliseconds (cumulative count 3031000)
30.580% <= 267.263 milliseconds (cumulative count 3058000)
30.970% <= 268.287 milliseconds (cumulative count 3097000)
31.230% <= 269.311 milliseconds (cumulative count 3123000)
31.440% <= 270.335 milliseconds (cumulative count 3144000)
31.550% <= 271.103 milliseconds (cumulative count 3155000)
31.670% <= 272.127 milliseconds (cumulative count 3167000)
31.940% <= 273.151 milliseconds (cumulative count 3194000)
32.220% <= 274.175 milliseconds (cumulative count 3222000)
32.500% <= 275.199 milliseconds (cumulative count 3250000)
32.750% <= 276.223 milliseconds (cumulative count 3275000)
32.930% <= 277.247 milliseconds (cumulative count 3293000)
33.160% <= 278.271 milliseconds (cumulative count 3316000)
33.360% <= 279.295 milliseconds (cumulative count 3336000)
33.500% <= 280.319 milliseconds (cumulative count 3350000)
33.640% <= 281.343 milliseconds (cumulative count 3364000)
33.730% <= 282.111 milliseconds (cumulative count 3373000)
33.870% <= 283.135 milliseconds (cumulative count 3387000)
34.000% <= 284.159 milliseconds (cumulative count 3400000)
34.150% <= 285.183 milliseconds (cumulative count 3415000)
34.360% <= 286.207 milliseconds (cumulative count 3436000)
34.640% <= 287.231 milliseconds (cumulative count 3464000)
34.940% <= 288.255 milliseconds (cumulative count 3494000)
35.130% <= 289.279 milliseconds (cumulative count 3513000)
35.330% <= 290.303 milliseconds (cumulative count 3533000)
35.470% <= 291.327 milliseconds (cumulative count 3547000)
35.920% <= 292.351 milliseconds (cumulative count 3592000)
36.420% <= 293.119 milliseconds (cumulative count 3642000)
37.500% <= 294.143 milliseconds (cumulative count 3750000)
38.710% <= 295.167 milliseconds (cumulative count 3871000)
40.020% <= 296.191 milliseconds (cumulative count 4002000)
41.770% <= 297.215 milliseconds (cumulative count 4177000)
43.360% <= 298.239 milliseconds (cumulative count 4336000)
44.950% <= 299.263 milliseconds (cumulative count 4495000)
46.410% <= 300.287 milliseconds (cumulative count 4641000)
48.080% <= 301.311 milliseconds (cumulative count 4808000)
49.730% <= 302.335 milliseconds (cumulative count 4973000)
50.910% <= 303.103 milliseconds (cumulative count 5091000)
52.240% <= 304.127 milliseconds (cumulative count 5224000)
53.410% <= 305.151 milliseconds (cumulative count 5341000)
54.620% <= 306.175 milliseconds (cumulative count 5462000)
55.780% <= 307.199 milliseconds (cumulative count 5578000)
56.850% <= 308.223 milliseconds (cumulative count 5685000)
57.860% <= 309.247 milliseconds (cumulative count 5786000)
58.780% <= 310.271 milliseconds (cumulative count 5878000)
59.650% <= 311.295 milliseconds (cumulative count 5965000)
60.440% <= 312.319 milliseconds (cumulative count 6044000)
61.510% <= 313.343 milliseconds (cumulative count 6151000)
62.240% <= 314.111 milliseconds (cumulative count 6224000)
63.220% <= 315.135 milliseconds (cumulative count 6322000)
64.350% <= 316.159 milliseconds (cumulative count 6435000)
65.440% <= 317.183 milliseconds (cumulative count 6544000)
66.510% <= 318.207 milliseconds (cumulative count 6651000)
67.590% <= 319.231 milliseconds (cumulative count 6759000)
68.750% <= 320.255 milliseconds (cumulative count 6875000)
69.860% <= 321.279 milliseconds (cumulative count 6986000)
70.840% <= 322.303 milliseconds (cumulative count 7084000)
71.920% <= 323.327 milliseconds (cumulative count 7192000)
72.940% <= 324.351 milliseconds (cumulative count 7294000)
73.650% <= 325.119 milliseconds (cumulative count 7365000)
74.540% <= 326.143 milliseconds (cumulative count 7454000)
75.510% <= 327.167 milliseconds (cumulative count 7551000)
76.290% <= 328.191 milliseconds (cumulative count 7629000)
76.930% <= 329.215 milliseconds (cumulative count 7693000)
77.630% <= 330.239 milliseconds (cumulative count 7763000)
78.400% <= 331.263 milliseconds (cumulative count 7840000)
79.230% <= 332.287 milliseconds (cumulative count 7923000)
80.060% <= 333.311 milliseconds (cumulative count 8006000)
80.830% <= 334.335 milliseconds (cumulative count 8083000)
81.480% <= 335.103 milliseconds (cumulative count 8148000)
82.180% <= 336.127 milliseconds (cumulative count 8218000)
82.790% <= 337.151 milliseconds (cumulative count 8279000)
83.300% <= 338.175 milliseconds (cumulative count 8330000)
83.860% <= 339.199 milliseconds (cumulative count 8386000)
84.520% <= 340.223 milliseconds (cumulative count 8452000)
85.230% <= 341.247 milliseconds (cumulative count 8523000)
85.950% <= 342.271 milliseconds (cumulative count 8595000)
86.660% <= 343.295 milliseconds (cumulative count 8666000)
87.380% <= 344.319 milliseconds (cumulative count 8738000)
88.110% <= 345.343 milliseconds (cumulative count 8811000)
88.630% <= 346.111 milliseconds (cumulative count 8863000)
89.310% <= 347.135 milliseconds (cumulative count 8931000)
89.840% <= 348.159 milliseconds (cumulative count 8984000)
90.400% <= 349.183 milliseconds (cumulative count 9040000)
91.090% <= 350.207 milliseconds (cumulative count 9109000)
91.790% <= 351.231 milliseconds (cumulative count 9179000)
92.470% <= 352.255 milliseconds (cumulative count 9247000)
92.980% <= 353.279 milliseconds (cumulative count 9298000)
93.570% <= 354.303 milliseconds (cumulative count 9357000)
94.040% <= 355.327 milliseconds (cumulative count 9404000)
94.440% <= 356.351 milliseconds (cumulative count 9444000)
94.640% <= 357.119 milliseconds (cumulative count 9464000)
94.870% <= 358.143 milliseconds (cumulative count 9487000)
95.120% <= 359.167 milliseconds (cumulative count 9512000)
95.250% <= 360.191 milliseconds (cumulative count 9525000)
95.500% <= 361.215 milliseconds (cumulative count 9550000)
95.710% <= 362.239 milliseconds (cumulative count 9571000)
95.860% <= 363.263 milliseconds (cumulative count 9586000)
95.970% <= 364.287 milliseconds (cumulative count 9597000)
96.000% <= 365.311 milliseconds (cumulative count 9600000)
96.100% <= 367.103 milliseconds (cumulative count 9610000)
96.260% <= 368.127 milliseconds (cumulative count 9626000)
96.330% <= 369.151 milliseconds (cumulative count 9633000)
96.490% <= 370.175 milliseconds (cumulative count 9649000)
96.640% <= 371.199 milliseconds (cumulative count 9664000)
96.650% <= 372.223 milliseconds (cumulative count 9665000)
96.760% <= 373.247 milliseconds (cumulative count 9676000)
96.910% <= 374.271 milliseconds (cumulative count 9691000)
97.060% <= 375.295 milliseconds (cumulative count 9706000)
97.210% <= 376.319 milliseconds (cumulative count 9721000)
97.310% <= 377.343 milliseconds (cumulative count 9731000)
97.420% <= 378.111 milliseconds (cumulative count 9742000)
97.590% <= 379.135 milliseconds (cumulative count 9759000)
97.840% <= 380.159 milliseconds (cumulative count 9784000)
97.990% <= 381.183 milliseconds (cumulative count 9799000)
98.130% <= 382.207 milliseconds (cumulative count 9813000)
98.140% <= 388.351 milliseconds (cumulative count 9814000)
98.240% <= 397.311 milliseconds (cumulative count 9824000)
98.360% <= 398.335 milliseconds (cumulative count 9836000)
98.440% <= 399.103 milliseconds (cumulative count 9844000)
98.560% <= 400.127 milliseconds (cumulative count 9856000)
98.680% <= 401.151 milliseconds (cumulative count 9868000)
98.790% <= 402.175 milliseconds (cumulative count 9879000)
98.870% <= 403.199 milliseconds (cumulative count 9887000)
98.950% <= 404.223 milliseconds (cumulative count 9895000)
98.960% <= 405.247 milliseconds (cumulative count 9896000)
99.030% <= 406.271 milliseconds (cumulative count 9903000)
99.170% <= 407.295 milliseconds (cumulative count 9917000)
99.310% <= 408.319 milliseconds (cumulative count 9931000)
99.440% <= 409.343 milliseconds (cumulative count 9944000)
99.500% <= 410.111 milliseconds (cumulative count 9950000)
99.650% <= 411.135 milliseconds (cumulative count 9965000)
99.790% <= 412.159 milliseconds (cumulative count 9979000)
99.900% <= 413.183 milliseconds (cumulative count 9990000)
100.000% <= 573.439 milliseconds (cumulative count 10000000)

Summary:
  throughput summary: 1969667.12 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      291.223    26.528   302.591   358.655   406.271   573.439